bindMountResults/iothreads_2_pipeline_10_connections_512_payload_100_threads_12.txt
====== SET ======
  1000340 requests completed in 1.20 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 0.5 milliseconds
0.01% <= 0.6 milliseconds
0.01% <= 0.7 milliseconds
0.01% <= 1.0 milliseconds
0.02% <= 1.1 milliseconds
0.02% <= 4 milliseconds
2.33% <= 5 milliseconds
66.65% <= 6 milliseconds
88.52% <= 7 milliseconds
95.31% <= 8 milliseconds
95.73% <= 9 milliseconds
96.21% <= 10 milliseconds
97.85% <= 11 milliseconds
98.80% <= 12 milliseconds
99.38% <= 13 milliseconds
99.84% <= 14 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
832229.62 requests per second

====== GET ======
  1000670 requests completed in 1.07 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 3 milliseconds
0.09% <= 4 milliseconds
56.60% <= 5 milliseconds
86.63% <= 6 milliseconds
92.68% <= 7 milliseconds
94.32% <= 8 milliseconds
95.22% <= 9 milliseconds
97.14% <= 10 milliseconds
98.44% <= 11 milliseconds
99.17% <= 12 milliseconds
99.43% <= 13 milliseconds
99.47% <= 15 milliseconds
99.48% <= 17 milliseconds
99.49% <= 20 milliseconds
99.51% <= 21 milliseconds
99.68% <= 22 milliseconds
99.70% <= 25 milliseconds
99.74% <= 26 milliseconds
99.80% <= 27 milliseconds
99.88% <= 28 milliseconds
99.95% <= 29 milliseconds
99.96% <= 30 milliseconds
99.98% <= 31 milliseconds
100.00% <= 31 milliseconds
931722.56 requests per second

====== HSET ======
  1000370 requests completed in 1.27 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.02% <= 4 milliseconds
0.07% <= 5 milliseconds
58.70% <= 6 milliseconds
85.08% <= 7 milliseconds
95.41% <= 8 milliseconds
95.49% <= 9 milliseconds
95.78% <= 10 milliseconds
96.37% <= 11 milliseconds
97.97% <= 12 milliseconds
98.83% <= 13 milliseconds
99.07% <= 14 milliseconds
99.08% <= 15 milliseconds
99.23% <= 16 milliseconds
99.42% <= 17 milliseconds
99.49% <= 25 milliseconds
99.49% <= 26 milliseconds
99.55% <= 27 milliseconds
99.62% <= 28 milliseconds
99.70% <= 29 milliseconds
99.77% <= 30 milliseconds
99.84% <= 31 milliseconds
99.90% <= 32 milliseconds
99.90% <= 42 milliseconds
99.93% <= 43 milliseconds
99.95% <= 44 milliseconds
99.96% <= 45 milliseconds
100.00% <= 45 milliseconds
787073.12 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000400 requests completed in 1.32 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.01% <= 2 milliseconds
0.02% <= 4 milliseconds
0.08% <= 5 milliseconds
9.39% <= 6 milliseconds
89.61% <= 7 milliseconds
93.67% <= 8 milliseconds
95.15% <= 9 milliseconds
95.95% <= 10 milliseconds
96.29% <= 11 milliseconds
96.97% <= 12 milliseconds
98.88% <= 13 milliseconds
99.27% <= 14 milliseconds
99.56% <= 15 milliseconds
99.70% <= 16 milliseconds
99.87% <= 17 milliseconds
99.95% <= 18 milliseconds
99.98% <= 19 milliseconds
100.00% <= 19 milliseconds
759605.12 requests per second

====== LRANGE_100 (first 100 elements) ======
  1001451 requests completed in 15.46 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 25 milliseconds
0.07% <= 26 milliseconds
0.82% <= 27 milliseconds
2.58% <= 28 milliseconds
4.28% <= 29 milliseconds
5.06% <= 30 milliseconds
5.35% <= 31 milliseconds
5.47% <= 32 milliseconds
5.55% <= 33 milliseconds
5.61% <= 34 milliseconds
5.67% <= 35 milliseconds
5.71% <= 36 milliseconds
5.76% <= 37 milliseconds
5.79% <= 38 milliseconds
5.79% <= 50 milliseconds
5.84% <= 51 milliseconds
6.02% <= 52 milliseconds
6.93% <= 53 milliseconds
9.54% <= 54 milliseconds
13.35% <= 55 milliseconds
17.90% <= 56 milliseconds
22.33% <= 57 milliseconds
26.66% <= 58 milliseconds
30.97% <= 59 milliseconds
35.28% <= 60 milliseconds
39.78% <= 61 milliseconds
44.33% <= 62 milliseconds
48.81% <= 63 milliseconds
53.23% <= 64 milliseconds
57.67% <= 65 milliseconds
62.25% <= 66 milliseconds
66.98% <= 67 milliseconds
71.85% <= 68 milliseconds
76.49% <= 69 milliseconds
80.49% <= 70 milliseconds
83.50% <= 71 milliseconds
85.40% <= 72 milliseconds
87.12% <= 73 milliseconds
89.61% <= 74 milliseconds
92.45% <= 75 milliseconds
94.76% <= 76 milliseconds
96.00% <= 77 milliseconds
96.83% <= 78 milliseconds
97.40% <= 79 milliseconds
97.87% <= 80 milliseconds
98.17% <= 81 milliseconds
98.41% <= 82 milliseconds
98.65% <= 83 milliseconds
98.81% <= 84 milliseconds
98.93% <= 85 milliseconds
99.03% <= 86 milliseconds
99.13% <= 87 milliseconds
99.23% <= 88 milliseconds
99.30% <= 89 milliseconds
99.38% <= 90 milliseconds
99.45% <= 91 milliseconds
99.51% <= 92 milliseconds
99.55% <= 93 milliseconds
99.59% <= 94 milliseconds
99.63% <= 95 milliseconds
99.67% <= 96 milliseconds
99.73% <= 97 milliseconds
99.78% <= 98 milliseconds
99.83% <= 99 milliseconds
99.86% <= 100 milliseconds
99.88% <= 101 milliseconds
99.90% <= 102 milliseconds
99.92% <= 103 milliseconds
99.93% <= 104 milliseconds
99.94% <= 105 milliseconds
99.95% <= 109 milliseconds
99.97% <= 110 milliseconds
100.00% <= 111 milliseconds
100.00% <= 111 milliseconds
64781.10 requests per second

====== MSET (10 keys) ======
  1000220 requests completed in 4.25 seconds
  512 parallel clients
  100 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 2 milliseconds
0.00% <= 10 milliseconds
0.09% <= 11 milliseconds
0.18% <= 19 milliseconds
0.37% <= 20 milliseconds
37.52% <= 21 milliseconds
74.99% <= 22 milliseconds
90.29% <= 23 milliseconds
98.32% <= 24 milliseconds
98.51% <= 25 milliseconds
98.51% <= 26 milliseconds
99.02% <= 27 milliseconds
99.04% <= 28 milliseconds
99.12% <= 29 milliseconds
99.24% <= 30 milliseconds
99.31% <= 31 milliseconds
99.35% <= 37 milliseconds
99.36% <= 39 milliseconds
99.37% <= 40 milliseconds
99.40% <= 41 milliseconds
99.55% <= 42 milliseconds
99.73% <= 43 milliseconds
99.89% <= 44 milliseconds
99.98% <= 45 milliseconds
100.00% <= 45 milliseconds
235345.88 requests per second